---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetX
source: html/1aa4db18-1cac-878e-506c-12a9aad40fa0.htm
---
# Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".